IDEA Open Model
StageLoading Class
Compatible with IDEA StatiCa 20.1
 Staged loading
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.Load.StageLoading
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class StageLoading
Public Class StageLoading
The StageLoading type exposes the following members.
Constructors
Name | Description
StageLoading
Initializes a new instance of the StageLoading class
Top
Properties
Name | Description
PermanentForces
 Primary internal force in section
Time
 Time
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace